music_app/app/models/user.rb

  def password=(password)
    @password = password
    self.password_digest = BCrypt::Password.create(password)
---
INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def ensure_session_token
    self.session_token = SecureRandom.urlsafe_base64
    self.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "FVsBpmfUAgoTuTOn-lu07Q"], ["updated_at", "2018-09-13 21:07:36.580282"], ["id", 2]]