music_app/app/controllers/bands_controller.rb

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Grendel"], ["created_at", "2018-09-13 23:49:02.372193"], ["updated_at", "2018-09-13 23:49:02.372193"]]
---
  def create
    @band = Band.new(name: params[:band][:name])
    if @band.save

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Infected Mushroom"], ["updated_at", "2018-09-14 00:20:05.395333"], ["id", 1]]
---
  def update
    band = Band.find_by(id: params[:id])
    if band
      band.name = params[:band][:name]
      band.save