music_app/app/views/bands/edit.html.erb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  <input type="hidden" name="_method" value="patch">
  <input type="text" name="band[name]" value="<%= Band.find_by(id: params[:id]).name %>">