music_app/app/views/bands/show.html.erb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
<br>
<%= Band.find_by(id: params[:id]).name %>